#include "xentax.h"
#include "x_file.h"
#include "x_findfile.h"
#include "x_amc.h"
#include "x_dds.h"
#include "x_namco.h"
using namespace std;

// for vertex formats
#include "x_namco.inl"

void zero_small(real32& value)
{
 if(std::fabs(value) < 1.0e-4f) value = 0.0f;
}

//
// ARCHIVES (PAC)
//

namespace NAMCO {

STDSTRING GetExtensionFHM(boost::shared_array<char> data, uint32 size)
{
 // read magic number
 binary_stream bs(data, size);
 uint32 magic = bs.BE_read_uint32();
 if(bs.fail()) return STDSTRING(TEXT("unknown"));

 switch(magic) {
   case(0x42534446) : return STDSTRING(TEXT("BSDF")); // BSDF
   case(0x4253464F) : return STDSTRING(TEXT("BSFO")); // BSFO
   case(0x43484752) : return STDSTRING(TEXT("CHGR")); // CHGR
   case(0x2C435052) : return STDSTRING(TEXT("CPRM")); // CPRM
   case(0x4446434C) : return STDSTRING(TEXT("DFCL")); // DFCL
   case(0x444D4D59) : return STDSTRING(TEXT("DMMY")); // DMMY
   case(0x444E534F) : return STDSTRING(TEXT("DNSO")); // DNSO
   case(0x45465020) : return STDSTRING(TEXT("EFP")); // EFP
   case(0x45494458) : return STDSTRING(TEXT("EIDX")); // EIDX
   case(0x46484D20) : return STDSTRING(TEXT("FHM")); // FHM
   case(0x4B504B50) : return STDSTRING(TEXT("KPKP")); // KPKP
   case(0x4C4D4200) : return STDSTRING(TEXT("LMB")); // LMB
   case(0x4E445033) : return STDSTRING(TEXT("NDP3")); // NDP3
   case(0x4E464800) : return STDSTRING(TEXT("NFH")); // NFH

     if(!ExtractNTP3(filelist[i].c_str(), do_delete, rbo)) {
        if(break_on_errors) return false;
       }
    }
 cout << endl;
 return true;
}

};

//
// MODELS (NDP3)
//

namespace NAMCO {

bool ExtractNDP3(LPCTSTR filename, MATERIALFUNCTION mf, bool do_delete)
{
 // open file
 ifstream ifile(filename, ios::binary);
 if(!ifile) return error("Failed to open file.");

 // determine filesize
 uint32 filesize = 0x00;
 ifile.seekg(0, ios::end);
 filesize = (uint32)ifile.tellg();
 ifile.seekg(0, ios::beg);

 // filename properties
 STDSTRING pathname = GetPathnameFromFilename(filename).get();
 STDSTRING shrtname = GetShortFilenameWithoutExtension(filename).get();

 // create debug file
 bool debug = true;
 ofstream dfile;
 if(debug) {
    STDSTRINGSTREAM ss;
    ss << pathname << shrtname << TEXT(".debug");
    dfile.open(ss.str().c_str());
    if(!dfile) return error("Failed to create debug file.");
   }

 // read header 0x00 - 0x0F
 uint32 h01 = BE_read_uint32(ifile); // NDP3
 uint32 h02 = BE_read_uint32(ifile); // filesize
 uint16 h03 = BE_read_uint16(ifile); // 0x200 (GEFB, SCLS) 0x201 (TR)
 uint16 h04 = BE_read_uint16(ifile); // number of 0x30-byte mesh info entries
 uint16 h05 = BE_read_uint16(ifile); // unknown (sum these to get number of bones in base body)
 uint16 h06 = BE_read_uint16(ifile); // unknown (sum these to get number of bones in base body)
 // read header 0x10 - 0x1F
 uint32 h07 = BE_read_uint32(ifile); // size of mesh information
 uint32 h08 = BE_read_uint32(ifile); // size of idx buffer
 uint32 h09 = BE_read_uint32(ifile); // size of vtx buffer #1
 uint32 h10 = BE_read_uint32(ifile); // size of vtx buffer #2
 // read header 0x20 - 0x2F
 real32 h11 = BE_read_real32(ifile);
 real32 h12 = BE_read_real32(ifile);
 real32 h13 = BE_read_real32(ifile);
 real32 h14 = BE_read_real32(ifile);

 // debug output
 if(debug) {
    dfile << "------------" << endl;
    dfile << "-- HEADER --" << endl;
    dfile << "------------" << endl;
    dfile << endl;
    dfile << "h01: 0x" << hex << h01 << dec << endl;
    dfile << "h02: 0x" << hex << h02 << dec << endl;
    dfile << "h03: 0x" << hex << h03 << dec << endl;
    dfile << "h04: 0x" << hex << h04 << dec << endl;
    dfile << "h05: 0x" << hex << h05 << dec << endl;
    dfile << "h06: 0x" << hex << h06 << dec << endl;
    dfile << "h07: 0x" << hex << h07 << dec << endl;
    dfile << "h08: 0x" << hex << h08 << dec << endl;
    dfile << "h09: 0x" << hex << h09 << dec << endl;
    dfile << "h10: 0x" << hex << h10 << dec << endl;
    dfile << "h11: " << h11 << " ???" << endl;
    dfile << "h12: " << h12 << " ???" << endl;
    dfile << "h13: " << h13 << " ???" << endl;
    dfile << "h14: " << h14 << " ???" << endl;
    dfile << endl;
   }

 // validate header
 if(!(h01 == 0x4E445033 || h01 == 0x4E445852)) return error("Invalid NDP3/NDXR.");
 if(!(h03 == 0x200 || h03 == 0x201)) return error("Invalid NDP3. Conversion failed.");

 // read mesh information
 struct MESHINFOENTRY1 {
  real32 p01[8]; // bounding boxes
  uint32 p02;    // offset into mesh names
  uint32 p03;    // 0x2C
  uint16 p04;    // blendindex
  uint16 p05;    // number of parts
  uint32 p06;    // absolute offset to PARTINFOENTRY array
 };
 deque<MESHINFOENTRY1> entrylist1;
 for(uint32 i = 0; i < h04; i++) {
     MESHINFOENTRY1 item;
     BE_read_array(ifile, &item.p01[0], 8);
     item.p02 = BE_read_uint32(ifile);
     item.p03 = BE_read_uint32(ifile);
     item.p04 = BE_read_uint16(ifile);
     item.p05 = BE_read_uint16(ifile);
     item.p06 = BE_read_uint32(ifile);
     entrylist1.push_back(item);
    }

 // debug output
 if(debug) {
    dfile << "----------------------" << endl;
    dfile << "-- MESH INFORMATION --" << endl;
    dfile << "----------------------" << endl;
    dfile << endl;
    for(uint32 i = 0; i < h04; i++) {
        dfile << "MESH 0x" << i << endl;
        dfile << entrylist1[i].p01[0] << " unknown vector" << endl;
        dfile << entrylist1[i].p01[1] << " " << endl;
        dfile << entrylist1[i].p01[2] << " " << endl;
        dfile << entrylist1[i].p01[3] << " " << endl;
        dfile << entrylist1[i].p01[4] << " unknown vector " << endl;
        dfile << entrylist1[i].p01[5] << "  " << endl;
        dfile << entrylist1[i].p01[6] << "  " << endl;
        dfile << entrylist1[i].p01[7] << "  " << endl;
        dfile << "0x" << hex << entrylist1[i].p02 << dec << "  offset into mesh names" << endl;
        dfile << "0x" << hex << entrylist1[i].p03 << dec << "  0x2C" << endl;
        dfile << "0x" << hex << entrylist1[i].p04 << dec << "  unknown" << endl;
        dfile << "0x" << hex << entrylist1[i].p05 << dec << "  number of parts" << endl;
        dfile << "0x" << hex << entrylist1[i].p06 << dec << "  offset to parts" << endl;
        dfile << endl;
       }
   }

 // 00000000 - 00000000 - 00000000 - 0558 - 1312 - 00000210 - 00000288 - 00000330 - 000003D8 - 0851 - 0004 - 00000000 - 00000000 - 00000000
 // 000010A2 - 00002AC0 - 00020100 - 0038 - 1312 - 00000450 - 000004C8 - 00000540 - 000005B8 - 0049 - 0004 - 00000000 - 00000000 - 00000000
 // 00001134 - 00002C80 - 00021600 - 0136 - 1312 - 00000630 - 000006A8 - 00000750 - 000007F8 - 01E7 - 0004 - 00000000 - 00000000 - 00000000
 // 00001502 - 00003630 - 00028A40 - 07B8 - 1312 - 00000870 - 000008E8 - 00000990 - 00000A38 - 0C08 - 0004 - 00000000 - 00000000 - 00000000
 // 00002D12 - 000073F0 - 00056F40 - 093F - 1312 - 00000AB0 - 00000B28 - 00000BD0 - 00000C78 - 0D57 - 0004 - 00000000 - 00000000 - 00000000
 // 000047C0 - 0000BDE8 - 0008E6E0 - 0025 - 1312 - 00000CF0 - 00000D68 - 00000E10 - 00000EB8 - 0065 - 0004 - 00000000 - 00000000 - 00000000
 // 0000488A - 0000BF10 - 0008F4C0 - 02AC - 1312 - 00000F30 - 00000FA8 - 00001050 - 000010F8 - 036D - 0004 - 00000000 - 00000000 - 00000000
 // 00004F64 - 0000D470 - 0009F540 - 06FC - 1312 - 00001170 - 000011E8 - 00001290 - 00001338 - 0AED - 0004 - 00000000 - 00000000 - 00000000
 // 0000653E - 00010C50 - 000C93C0 - 037C - 1312 - 000013B0 - 00001428 - 000014D0 - 00001578 - 0504 - 0004 - 00000000 - 00000000 - 00000000
 // OK         OK         OK         OK     OK     OK         OK         OK         OK         OK     OK
 // read part information
 struct PARTINFOENTRY {
  uint32 mesh_id;
  uint32 part_id;
  uint32 p01; // 0x00: offset into ib
  uint32 p02; // 0x04: offset into vb #1
  uint32 p03; // 0x08: offset into vb #2
  uint16 p04; // 0x0C: number of vertices
  uint16 p05; // 0x0E: vertex format
  uint32 p06; // 0x10: absolute offset into material property data
  uint32 p07; // 0x14: zero? 
  uint32 p08; // 0x18: zero?
  uint32 p09; // 0x1C: zero?
  uint16 p10; // 0x1E: number of indices
  uint16 p11; // 0x22: index buffer format
  uint32 p12; // 0x24: zero?
  uint32 p13; // 0x28: zero?
  uint32 p14; // 0x2C: zero?
 };
 deque<PARTINFOENTRY> entrylist2;
 for(uint32 i = 0; i < entrylist1.size(); i++)
    {
     // seek offset
     uint32 offset = entrylist1[i].p06;
     ifile.seekg(offset);

     // for each entry #2
     uint16 n_item = entrylist1[i].p05;
     for(uint32 j = 0; j < n_item; j++)
        {
         // read entry
         PARTINFOENTRY item;
         item.mesh_id = i;
         item.part_id = j;
         item.p01 = BE_read_uint32(ifile);
         item.p02 = BE_read_uint32(ifile);
         item.p03 = BE_read_uint32(ifile);
         item.p04 = BE_read_uint16(ifile);
         item.p05 = BE_read_uint16(ifile);
         item.p06 = BE_read_uint32(ifile);
         item.p07 = BE_read_uint32(ifile);
         item.p08 = BE_read_uint32(ifile);
         item.p09 = BE_read_uint32(ifile);
         item.p10 = BE_read_uint16(ifile);
         item.p11 = BE_read_uint16(ifile);
         item.p12 = BE_read_uint32(ifile);
